package com.algorithm.STUnitas.actual_test;

/**
 * Created by betterFLY on 2018. 8. 23.
 * Github : http://github.com/betterfly88
 */

/*
주명이와 원두
에스티유니타스의 본사에는 커피머신이 있다. 최근 몇개월간 맛의 진화를 거듭한 이 커피머신은 각각이 다른 원두를 사용하고 있다. 비교적 최근까지 커피머신이 있는지 몰랐던 주명이는 컬처팀과 밥을 먹던 도중 문득 궁금증이 생겼다.

'컬처팀의 예산을 사용하여 주문할 수 있는 모든 경우의 수 중 "주문 이후 재고가 제일 적은 원두의 양"이 다른 경우 보다 큰 최대량은 과연 몇g일까?'

컬처팀의 예산(M), 현재 남아있는 각각의 원두 양(Bi), 가각의 원두 1g당 가격(Ci)가 주어질 때, 주명이를 도와 최대 몇g까지 모든 원두의 재고를 맞출 수 있는지 알아내는 프로그램을 작성하시오.

입력
전체 입력의 첫 번째 줄은 테스트 케이스의 개수를 나타내는 정수 T가 주어진다.

각 테스트 케이스의 첫 번째 줄에는 원두의 개수를 나타내는 정수 N과 컬처팀의 예산을 나타내는 정수 M이 주어진다. 두 번째 줄에는 각 원두의 현재 남은 원두의 양을 나타내는 정수 Bi가 주어지고, 세 번째 줄에는 각 원두의 1g당 가격을 나타내는 정수 Ci가 주어진다.

원두 주문은 1g 단위로만 가능하다.

제약 조건
T <= 10,000
1 <= N <= 100
1 <= M <= 109
1 <= Bi <= 109
1 <= Ci <= 107

입력
3
5 100
1 2 3 4 5
5 4 3 2 1
5 10
1 2 3 4 5
5 4 3 2 1
5 1
1 2 3 4 5
5 4 3 2 1

출력
9
2
1

 */
public class solution_3 {
}
