package com.algorithm.STUnitas.actual_test;

/**
 * Created by betterFLY on 2018. 8. 23.
 * Github : http://github.com/betterfly88
 */

/*

코엑스는 미궁이다. 길을 헤매기로 유명한 상필이는 가장 빠른 경로로 코엑스를 벗어나고자 한다.

NxN으로 이루어진 코엑스 지도가 주어지고, 지도상에서 1이 이동가능한 칸, 0이 이동불가능한 칸을 뜻한다.

(1,1)에서 시작하여 상하좌우로만 이동이 가능할때, 상필이는 최소 몇번의 이동만으로 (N,N)에 도착할 수 있을까?


입력
첫째 줄에 두 정수 N, M(2≤N≤100)이 주어진다. 다음 N개의 줄에는 N개의 정수로 이루어진 지도가 주어진다. 각각의 수들은 붙어서 입력으로 주어진다. (1,1)은 항상 1로 주어진다.

출력
첫째 줄에 최소의 이동횟수를 출력한다. (N,N)에 도착이 불가능한 경우는 주어지지 않는다.

예시
아래의 지도는 (1,1)에서 시작하여 최소 16번만에 (N,N)에 도착이 가능하다.

시작점인 (1,1)은 이동횟수에 포함되지 않음을 주의하자.

1	0	1	1	1
1	0	1	0	1
1	0	1	0	1
1	0	1	0	1
1	1	1	0	1


입력
5
10111
10101
10101
10101
11101

출력
16

 */

public class solution_4 {
}
